20241123T090824--kdoc-307-乗算と左ビットシフトの実行速度を計測する__permanent.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-03T16:38:41Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 307: 乗算と左ビットシフトの実行速度を計測する</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 307: 乗算と左ビットシフトの実行速度を計測する</h1>
<div id="outline-container-orgda4fc18" class="outline-2">
<h2 id="orgda4fc18"><a href="#orgda4fc18">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-orgda4fc18">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-11-25 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-11-30 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org41a4414" class="outline-2">
<h2 id="org41a4414"><a href="#org41a4414">概要</a></h2>
<div class="outline-text-2" id="text-org41a4414">
<p>
よく左ビットシフト命令に最適化するのを見るが、どれくらいの速度の違いがあるのだろうか。
</p>

<iframe width="800px" height="400px" src="https://godbolt.org/e#g:!((g:!((g:!((h:codeEditor,i:(filename:'1',fontScale:14,fontUsePx:'0',j:1,lang:go,selection:(endColumn:20,endLineNumber:15,positionColumn:20,positionLineNumber:15,selectionStartColumn:20,selectionStartLineNumber:15,startColumn:20,startLineNumber:15),source:'//+Type+your+code+here,+or+load+an+example.%0A//+Your+function+name+should+start+with+a+capital+letter.%0Apackage+main%0A%0Afunc+main()+%7B%0A%09_+%3D+shl(42)%0A%09_+%3D+mul(42)%0A%7D%0A%0A//go:noinline%0Afunc+shl(a+int)+int+%7B%0A%09return+a+*+4%0A%7D%0A%0A//+%E3%82%B0%E3%83%AD%E3%83%BC%E3%83%90%E3%83%AB%E5%A4%89%E6%95%B0%E3%81%AB%E3%81%97%E3%81%A6%E6%9C%80%E9%81%A9%E5%8C%96%E3%82%92%E9%98%B2%E3%81%90%0Avar+num+%3D+4%0A%0A//go:noinline%0Afunc+mul(a+int)+int+%7B%0A%09return+a+*+num%0A%7D'),l:'5',n:'0',o:'Go+source+%231',t:'0')),k:50,l:'4',n:'0',o:'',s:0,t:'0'),(g:!((h:compiler,i:(compiler:gl1232,filters:(b:'0',binary:'1',binaryObject:'1',commentOnly:'0',debugCalls:'1',demangle:'0',directives:'0',execute:'1',intel:'1',libraryCode:'0',trim:'0',verboseDemangling:'0'),flagsViewOpen:'1',fontScale:14,fontUsePx:'0',j:1,lang:go,libs:!(),options:'',overrides:!(),selection:(endColumn:1,endLineNumber:1,positionColumn:1,positionLineNumber:1,selectionStartColumn:1,selectionStartLineNumber:1,startColumn:1,startLineNumber:1),source:1),l:'5',n:'0',o:'+x86-64+gc+1.23.2+(Editor+%231)',t:'0')),k:50,l:'4',n:'0',o:'',s:0,t:'0')),l:'2',n:'0',o:'',t:'0')),version:4"></iframe>

<p>
計測するコードを書く。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>bench_test.go</label><pre class="src src-go">package main

import "testing"

func BenchmarkShl(b *testing.B) {
	for i := 0; i &lt; b.N; i++ {
		_ = shl(42)
	}
}

func BenchmarkMultiply(b *testing.B) {
	for i := 0; i &lt; b.N; i++ {
		_ = mul(42)
	}
}

//go:noinline
func shl(a int) int {
	return a * 4
}

// グローバル変数にしないと最適化される
var num = 4

//go:noinline
func mul(a int) int {
	return a * num
}
</pre>
</div>

<p>
<a href="20241123T012402--kdoc-305-加算と左ビットシフトの実行速度を計測する__permanent.html#ID-20241123T012402">KDOC 305: 加算と左ビットシフトの実行速度を計測する</a>と同様の方法で計測する。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>計測する</label><pre class="src src-shell">$ go test -bench . -benchmem -count 100 &gt; exec.log
$ benchstat exec.log
(&#30053;)
            &#9474;   exec.log   &#9474;
            &#9474;    sec/op    &#9474;
Shl-16        0.4839n &#177; 0%
Multiply-16   0.5117n &#177; 1%
geomean       0.4976n
(&#30053;)
</pre>
</div>

<p>
ということで、0.03ナノ秒ほど左ビットシフト演算のほうが早い。だから左ビットシフトに最適化するわけだ。
</p>
</div>
</div>
<div id="outline-container-org74a855b" class="outline-2">
<h2 id="org74a855b"><a href="#org74a855b">関連</a></h2>
<div class="outline-text-2" id="text-org74a855b">
<ul class="org-ul">
<li><a href="20241122T231155--kdoc-304-加算と乗算どちらが早いか__permanent.html#ID-20241122T231155">KDOC 304: 加算と乗算どちらが早いか?</a>。調べるきっかけとなった疑問</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
